Revit 2027 API
ReferenceType Enumeration
Reference types of curve element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ReferenceType
Public Enumeration ReferenceType
public enum class ReferenceType
type ReferenceType
Members
Member name | Value | Description
None | 0
StrongReference | 2
WeakReference | 1
See Also
Reference
Autodesk.Revit.DB Namespace